/**
 * @description icon svg
 * @author Apisit Lee
 */

/**
 * 【注意】svg 字符串的长度 ，否则会导致代码体积过大
 * 尽量选择 https://www.iconfont.cn/collections/detail?spm=a313x.7781069.0.da5a778a4&cid=20293
 * 找不到再从 iconfont.com 搜索
 */

// 上传图片
export const IMAGE_MODAL_SVG =
  '<svg t="1657618838790" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1527" width="48" height="48"><path d="M409.829397 609.524996a238.4 314.9 72.471 1 0 600.555003-189.688505 238.4 314.9 72.471 1 0-600.555003 189.688505Z" fill="#4EEAAB" p-id="1528"></path><path d="M972.8 256H51.2C22.9 256 0 278.9 0 307.2v614.4c0 28.3 22.9 51.2 51.2 51.2h921.6c28.3 0 51.2-22.9 51.2-51.2V307.2c0-28.3-22.9-51.2-51.2-51.2z m-25.6 640H76.8V332.8h870.4V896zM204.8 230.4h614.4c21.2 0 38.4-17.2 38.4-38.4s-17.2-38.4-38.4-38.4H204.8c-21.2 0-38.4 17.2-38.4 38.4s17.2 38.4 38.4 38.4zM307.2 128h409.6c21.2 0 38.4-17.2 38.4-38.4S738 51.2 716.8 51.2H307.2c-21.2 0-38.4 17.2-38.4 38.4S286 128 307.2 128z" fill="#454563" p-id="1529"></path></svg>'
